InformationRegisters/РИНЭКО_ИсторияИзмененияСтатуса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>РИНЭКО_ИсторияИзмененияСтатуса</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РИНЭКО_ИсторияИзмененияСтатуса/Ext/ManagerModule.bsl
// + [Rineco], [Киселев А.Н.] [19.10.2021] 
// Задача: [№ 20449], [# Добавляем запись]
Процедура ДобавитьНовуюЗапись(Договор,Статус) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РИНЭКО_ИсторияИзмененияСтатуса.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Договор = Договор;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
